; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain test_domain)
    (:requirements :typing :equality)
    (:types
        physobj - object
        vehicle - physobj
        package - physobj
        airplane - vehicle
        truck - vehicle
        place - object
        location - place
        airport - place
        city - object
    )

    (:constants
        
    )

    (:predicates
        (in-city ?x1 - place ?x2 - city)
        (at ?x1 - physobj ?x2 - place)
        (in ?x1 - package ?x2 - vehicle)
    )

    (:functions
        
    )

    

    
    (:action LOAD-TRUCK
     :parameters (?pkg - package ?truck - truck ?loc - place)
     :precondition (and (at ?truck ?loc) (at ?pkg ?loc))
     :effect (and
        (in ?pkg ?truck)
        (not (at ?pkg ?loc)))
    )


    (:action LOAD-AIRPLANE
     :parameters (?pkg - package ?airplane - airplane ?loc - place)
     :precondition (and (at ?pkg ?loc) (at ?airplane ?loc))
     :effect (and
        (in ?pkg ?airplane)
        (not (at ?pkg ?loc)))
    )


    (:action UNLOAD-TRUCK
     :parameters (?pkg - package ?truck - truck ?loc - place)
     :precondition (in ?pkg ?truck)
     :effect (and
        (at ?pkg ?loc)
        (not (in ?pkg ?truck)))
    )


    (:action UNLOAD-AIRPLANE
     :parameters (?pkg - package ?airplane - airplane ?loc - place)
     :precondition (and (in ?pkg ?airplane) (at ?airplane ?loc))
     :effect (and
        (at ?pkg ?loc)
        (not (in ?pkg ?airplane)))
    )


    (:action DRIVE-TRUCK
     :parameters (?truck - truck ?loc-from - place ?loc-to - place ?city - city)
     :precondition (and (at ?truck ?loc-from) (in-city ?loc-from ?city) (in-city ?loc-to ?city))
     :effect (and
        (at ?truck ?loc-to)
        (not (at ?truck ?loc-from)))
    )


    (:action FLY-AIRPLANE
     :parameters (?airplane - airplane ?loc-from - airport ?loc-to - airport)
     :precondition (and )
     :effect (and
        (at ?airplane ?loc-to)
        (not (at ?airplane ?loc-from)))
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem instance1)
    (:domain test_domain)

    (:objects
        apn1 - airplane
        apt1 apt2 - airport
        cit1 cit2 - city
        pos1 pos2 - location
        obj11 obj12 obj13 obj21 obj22 obj23 - package
        tru1 tru2 - truck
    )

    (:init
        (at obj11 pos1)
        (at obj13 pos1)
        (at apn1 apt1)
        (at tru1 pos1)
        (at obj21 pos2)
        (at obj22 pos2)
        (at obj12 pos1)
        (at obj23 pos2)
        (at tru2 pos2)
        (in-city apt1 cit1)
        (in-city pos1 cit1)
        (in-city pos2 cit2)
        (in-city apt2 cit2)
    )

    (:goal
        (and (at obj21 apt1) (at obj23 pos2) (at obj12 pos1) (at obj11 pos2))
    )

    
    
    
)

; plan
1. (load-truck obj21 tru2 pos2)
   deleted: (at obj21 pos2)
   added: (in obj21 tru2)
   goals met: 2 of 4
2. (load-truck obj11 tru1 pos1)
   deleted: (at obj11 pos1)
   added: (in obj11 tru1)
   goals met: 2 of 4
3. (unload-truck obj21 tru2 apt1)
   deleted: (in obj21 tru2)
   added: (at obj21 apt1)
   goals met: 3 of 4
4. (unload-truck obj11 tru1 pos2)
   deleted: (in obj11 tru1)
   added: (at obj11 pos2)
   goals met: 4 of 4
